/**
 * Created by @KarlAo on 2019/1/3
 * @description:
 */

export default "## 二叉树遍历\n" +
"- 深度优先遍历；\n" +
"\t- 前序优先遍历；从上到下优先，从左到右其次\n" +
"\t\t1. 访问根节点\n" +
"\t\t2. 前序遍历左子树\n" +
"\t\t3. 前序遍历右子树\n" +
"\t- 中序优先遍历；从左到右优先，从上到下其次\n" +
"\t\t1. 中序遍历左子树；\n" +
"\t\t2. 访问根节点；\n" +
"\t\t3. 中序遍历右子树；\n" +
"\t- 后序优先遍历；从左到右优先，从下到上其次\n" +
"\t\t1. 后序遍历左子树；\n" +
"\t\t2. 后序遍历右子树\n" +
"\t\t3. 打印根\n" +
"- 广度优先遍历\n" +
"\t-从左到右，按照层级优先遍历\n" +
"\n" +
"```javascript\n" +
"\tfunction a(){\n" +
"\t\tconst a = 1;\n" +
"\t}\n" +
"```"